In [2]:
import pandas as pd

In [ ]:
df=pd.read_csv('input_data/Multi-Year Price Data (Aggregate).csv')
df.head()

       Date  Price
0  1/1/2012     99
1  1/2/2012     95
2  1/3/2012     96
3  1/4/2012     95
4  1/5/2012     93

In [9]:
df.describe()

             Price
count  1476.000000
mean    114.102981
std      20.482524
min      81.000000
25%      99.000000
50%     111.500000
75%     124.000000
max     281.000000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1476 entries, 0 to 1475
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1476 non-null   object
 1   Price   1476 non-null   int64
dtypes: int64(1), object(1)
memory usage: 23.2+ KB